# COW System

DESCRIBE THE COW SYSTEM HERE

### Table of Contents
<ul>
    <li><a href='#gathering'>Gathering</a><li>
</ul>

In [1]:
import pandas as pd

In [2]:
# Import classes and functions needed for this analysis from config module
# These are only available on my computer
from config import dbaccess, validator, society, error_dict_to_string

# Create an instance of the DBAccess class for running queries
db = dbaccess.DBAccess()

# Create an instance of the Validator class for validating data prior to inserting/updating database
val = validator.Validator()

<a id='gathering'></a>
## Data Gathering

In [3]:
cow = pd.read_csv('system2016.csv')
cow.sample(5)

      stateabb  ccode  year  version
13068      COL    100  2002     2016
2177       ARG    160  1880     2016
12486      AAB     58  1999     2016
12711      POL    290  2000     2016
12581      BUI    516  1999     2016

In [5]:
states = pd.read_csv('states2016.csv')
states.sample(5)

,stateabb,ccode,statenme,styear,stmonth,stday,endyear,endmonth,endday,version
94,SLV,349,Slovenia,1992,1,15,2016,12,31,2016
5,HAI,41,Haiti,1859,1,1,1915,7,28,2016
34,PAR,150,Paraguay,1846,1,1,1870,6,20,2016
179,IRQ,645,Iraq,1932,10,3,2016,12,31,2016
74,CZE,315,Czechoslovakia,1945,5,10,1992,12,31,2016

In [7]:
majors = pd.read_csv('majors2016.csv')
majors.sample(5)

   stateabb  ccode  styear  stmonth  stday  endyear  endmonth  endday  version
7       AUH    300    1816        1      1     1918        11       3     2016
12      JPN    740    1895        4      1     1945         8      14     2016
10      RUS    365    1922        1      1     2016        12      31     2016
9       RUS    365    1816        1      1     1917        12       5     2016
5       GMY    255    1925        1      1     1945         5       7     2016